//===============================================================================================================
//
// debugproc.h
// author : Haruyuki Neko
//
//===============================================================================================================

/* インクルードガードの先頭 */
#ifndef _DEBUG_PROC_H_	// インクルードガード開始
#define _DEBUG_PROC_H_	// インクルードガード用マクロ定義

//============================================================================
//
// マクロ定義
//
//============================================================================

#define FONT_SIZE         ( 30 )		// 文字サイズ
#define MAX_FONT          ( 1024 )		// 文字の最大数

//============================================================================
//
// 関数プロトタイプ宣言
//
//============================================================================

HRESULT InitDebugProc( void );	// デバック情報 初期化 関数
void DrawDebugProc(void);		// デバック情報の描画処理
void UpdataDebugProc(void);		// デバック情報の更新処理
void UnInitDebugProc(void);		// デバック情報の開放処理

void PrintDebugProc(char *fmt, ...);	// デバック情報出力するための処理

bool DebugProcFlg( void );				// デバック情報の描画フラグ取得

/* インクルードガードの最終行 */
#endif	// _DEBUG_PROC_H_