//===============================================================================================================
//
// DirectX3D.h
// author : Haruyuki Neko
//
//===============================================================================================================

/* インクルードガードの先頭 */
#ifndef _DIRECT_X_H_
#define _DIRECT_X_H_

//============================================================================
//
// インクルード
//
//============================================================================

#include <d3dx9.h>		// Direct3D & D3DX（ 内部で「d3d9.h」をインクルード ）
#include <dxerr.h>		// DirectXのエラー処理ユーティリティ・ライブラリ

//============================================================================
//
// 関数プロトタイプ宣言
//
//============================================================================

HRESULT InitDX(HWND hWnd);					// DirectXの初期化 関数
LPDIRECT3DDEVICE9 GetD3DDevice(void);		// DirectXデバイスのゲッター 関数
void ReleaseD3D(void);						// DirectXオブジェクトの開放 関数

/* インクルードガードの最終行 */
#endif	// _DIRECT_X_H_