//===============================================================================================================
//
// game.h
// author : Haruyuki Neko
//
//===============================================================================================================

/* インクルードガードの先頭 */
#ifndef _GAME_H_	// インクルードガード開始
#define _GAME_H_	// インクルードガード用マクロ定義

//============================================================================
//
// マクロ定義
//
//============================================================================

// 制限時間
#define TIME_LIMIT  ( 120 )

// 列挙型定数

/* ゲーム遷移 */
typedef enum
{
	SCENE_TITLE = 0,	// タイトル
	SCENE_TUTORIAL,		// チュートリアル
	SCENE_GAME,			// ゲーム
	SCENE_GAMEOVER,		// ゲームオーバー
	SCENE_CLEAR,		// ゲームクリア
	SCENE_RECORD,		// ゲームの記録
	SCENE_MAX,			// シーンの最大数
}GAMEMODE;

//============================================================================
//
// 関数プロトタイプ宣言
//
//============================================================================

void GameMain(void);	// ゲームのメイン処理

// ゲーム遷移
void Title(void);		// タイトル
void Tutorial(void);	// チュートリアル
void Game(void);		// ゲーム
void GameOver(void);	// ゲームオーバー
void GameClear(void);	// ゲームクリア
void GameRecord(void);	// ゲームレコード

void SetMode(GAMEMODE GameMode);
GAMEMODE GetMode(void);

int GetGameTime(void);	// ゲームの時間

/* インクルードガードの最終行 */
#endif	// _GAME_H_