//===============================================================================================================
//
// mashceiling.h
// author : Haruyuki Neko
//
//===============================================================================================================

/* インクルードガードの先頭 */
#ifndef _CEILING_H_
#define _CEILING_H_

//============================================================================
//
// マクロ定義
//
//============================================================================

// 地面のテクスチャファイル
#define CEILING_FILE              ( "data/TEXTURE/sky001.jpg" )

//============================================================================
//
// 関数プロトタイプ宣言
//
//============================================================================

HRESULT InitCeiling(void);	// 初期化
void DrawCeiling(void);		// 描画処理
void UpdataCeiling(void);	// 更新処理
void UnInitCeiling(void);	// 開放処理

MESH_FIELD GetCeiling(int nIdx);	// 天井の情報取得

/* インクルードガードの最終行 */
#endif	// _CEILING_H_