//===============================================================================================================
//
// mouse.h
// author : Haruyuki Neko
//
//===============================================================================================================

/* インクルードガードの先頭 */
#ifndef _MOUSE_H_
#define _MOUSE_H_

//============================================================================
//
// インクルード
//
//============================================================================

#include "input.h"

//============================================================================
//
// 構造体定義
//
//============================================================================

/* マウスポインタの情報 */
typedef struct
{
	float	x;			// X座標
	float	y;			// Y座標
	bool	lButton;	// 左ボタン
	bool	rButton;	// 右ボタン
	bool	cButton;	// 真ん中ボタン
	bool    bUse;		// マウスが使われているかどうか
}MOUSE;

typedef enum
{
	LEFT   = 0,	// 左ボタン
	RIGHT,		// 右ボタン
	CENTER,		// 真ん中ボタン
}MOUSE_CLICK;

//============================================================================
//
// 関数プロトタイプ宣言
//
//============================================================================

HRESULT InitDMouse(HINSTANCE hInstance, HWND hWnd);		// DirectInput 初期化関数
void ReleaseDMouse(void);								// DirectInputデバイスとオブジェクトの開放 関数
void UpdataDMouse(HWND hWnd);								// DirectInput 更新関数

bool nowClick(int nClick);								// キー入力判定
bool PushClick(int nClick);								// キー入力判定（ 押した瞬間 ）
bool ReleaseClick(int nClick);							// キー入力判定（ 離した瞬間 ）

MOUSE GetMouseState(void);

/* インクルードガードの最終行 */
#endif	// _MOUSE_H_