//=============================================================================================================
//
// サウンド関連のコードファイル
// 制作者：根子 晴行
//
//=============================================================================================================
#ifndef _SOUND_H_	// インクルードガード開始
#define _SOUND_H_	// インクルードガード用マクロ定義

#include <windows.h>

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
typedef struct
{
	char	*filename;	//サウンドファイル名
	BOOL	bLoop;		//ループサウンドかワンショットサウンドか
} SOUNDFILEPARAM;		// サウンドファイルパラメータ構造体

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
//-------------------------------------
// サウンド初期化処理
//引数：	SOUNDFILEPARAM	*	pParam	…	[in]	サウンドファイルパラメータの先頭ポインタ
//			int					nParam	…	[in]	サウンドファイルパラメータ数
//戻値：	BOOL						…			成功時TRUE、エラー時FALSE
//備考：	予めCOMの初期化を行っておくこと！
//-------------------------------------
BOOL	InitSnd( SOUNDFILEPARAM *pParam, int nParam );
//-------------------------------------
// サウンド終了処理
//引数：	無
//戻値：	BOOL						…			成功時TRUE、エラー時FALSE
//備考：	後にCOMの終了処理を行うこと！
//-------------------------------------
BOOL	UninitSnd( void );
//-------------------------------------
// サウンド停止関数
//引数：	SOUND_LABEL			label	…	[in]	指定サウンドファイルＩＤ
//戻値：	BOOL						…			成功時TRUE、エラー時FALSE
//-------------------------------------
BOOL	StopSnd( int label );
//-------------------------------------
// サウンド再生関数
//引数：	SOUND_LABEL			label	…	[in]	指定サウンドファイルＩＤ
//戻値：	BOOL						…			成功時TRUE、エラー時FALSE
//-------------------------------------
BOOL	PlaySnd( int label );

#endif//_SOUND_H_	// インクルードガード終了
