//===============================================================================================================
//
// tutorial.h
// author : Haruyuki Neko
//
//===============================================================================================================

// 画像全般ヘッダー

/* インクルードガードの先頭 */
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

//============================================================================
//
// マクロ定義
//
//============================================================================

// テクスチャファイル名
#define TEXTURE_TUTORIAL_FILE        "data/TEXTURE/Tutorial.png"
#define TEXTURE_TUTORIAL_2_FILE      "data/TEXTURE/Tutorial_2.png"

//============================================================================
//
// 関数プロトタイプ宣言
//
//============================================================================

HRESULT InitTutorial(void);		// 初期化 関数
void UpdateTutorial(void);		// 更新処理 関数
void DrawTutorial(void);		// 描画処理 関数
void UninitTutorial(void);		// 開放処理 関数

/* インクルードガードの最終行 */
#endif	// _TUTORIAL_H_