//===============================================================================================================
//
// fade.h
// author : Haruyuki Neko
//
//===============================================================================================================

/* インクルードガードの先頭 */
#ifndef _FADE_H_
#define _FADE_H_

//============================================================================
//
// インクルード
//
//============================================================================

#include "game.h"

//============================================================================
//
// マクロ定義
//
//============================================================================

// テクスチャファイル名
#define TEXTURE_FADE_FILE        "data/TEXTURE/fade.png"

// フェードの状態
typedef enum
{
	FADE_NONE = 0,		// 何もない状態
	FADE_IN,			// フェードイン処理
	FADE_OUT,			// フェードアウト処理
	BLACK_IN,
	BLACK_OUT,
	FADE_MAX,
}FADE;

//============================================================================
//
// 関数プロトタイプ宣言
//
//============================================================================

HRESULT InitFade(void);		// 初期化
void UpdateFade(void);		// 更新
void DrawFade(void);		// 描画
void UninitFade(void);		// 終了

void SetFade(FADE out, FADE in, GAMEMODE next);
FADE GetFade(void);

/* インクルードガードの最終行 */
#endif	// _FADE_H_
