//===============================================================================================================
//
// gameclear.h
// author : Haruyuki Neko
//
//===============================================================================================================

// 画像全般ヘッダー

/* インクルードガードの先頭 */
#ifndef _GAME_CLEAR_H_
#define _GAME_CLEAR_H_

//============================================================================
//
// マクロ定義
//
//============================================================================

// テクスチャファイル名
#define TEXTURE_CLEAR_FILE        "data/TEXTURE/goal.png"

//============================================================================
//
// 関数プロトタイプ宣言
//
//============================================================================

HRESULT InitGameClear(void);	// 初期化 関数
void UpdateGameClear(void);		// 更新処理 関数
void DrawGameClear(void);		// 描画処理 関数
void UninitGameClear(void);		// 開放処理 関数

/* インクルードガードの最終行 */
#endif	// _GAME_CLEAR_H_