//===============================================================================================================
//
// goal.h
// author : Haruyuki Neko
//
//===============================================================================================================

/* インクルードガードの先頭 */
#ifndef _GOAL_H_
#define _GOAL_H_

//============================================================================
//
// マクロ定義
//
//============================================================================

// ビルボードのテクスチャファイル　(ゴール)
#define GOAL_FILE              ( "data/TEXTURE/tree000.png" )
#define GOAL_SIZE              ( 120 )		// テクスチャのサイズ

//============================================================================
//
// 関数プロトタイプ宣言
//
//============================================================================

HRESULT InitGoal(void);		// ビルボードの初期化　　(ゴール)
void DrawGoal(void);		// ビルボードの描画処理　(ゴール)
void UpdataGoal(void);		// ビルボードの更新処理　(ゴール)
void UnInitGoal(void);		// ビルボードの開放処理　(ゴール)

BILLBOARD GetGoal(void);	// ビルボードの情報取得　(ゴール)

/* インクルードガードの最終行 */
#endif	// _GOAL_H_