//===============================================================================================================
//
// light.h
// author : Haruyuki Neko
//
//===============================================================================================================

/* インクルードガードの先頭 */
#ifndef _LIGHT_H_
#define _LIGHT_H_

//============================================================================
//
// 関数プロトタイプ宣言
//
//============================================================================

void InitLight(void);		// ライトの初期化
void UpdataLight(void);		// ライトの更新
void DrawLight(void);		// ライトの描画
void UnInitLight(void);		// ライトの終了処理

/* インクルードガードの最終行 */
#endif	// _LIGHT_H_