//===============================================================================================================
//
// title.h
// author : Haruyuki Neko
//
//===============================================================================================================

// 画像全般ヘッダー

/* インクルードガードの先頭 */
#ifndef _TITLE_H_
#define _TITLE_H_

//============================================================================
//
// マクロ定義
//
//============================================================================

// テクスチャファイル名
#define TEXTURE_TITLE_FILE        "data/TEXTURE/Title.png"
#define TEXTURE_TITLE_2_FILE      "data/TEXTURE/Title_2.png"

#define TEXTURE_ENTER_FILE        "data/TEXTURE/push_enter.png"

//============================================================================
//
// 関数プロトタイプ宣言
//
//============================================================================

HRESULT InitTitle(void);	// 初期化 関数
void UpdateTitle(void);		// 更新処理 関数
void DrawTitle(void);		// 描画処理 関数
void UninitTitle(void);		// 開放処理 関数

/* インクルードガードの最終行 */
#endif	// _TITLE_H_