//=============================================================================================================
//
// WAVEファイル関連コードファイル
// 制作者：根子 晴行
//
//=============================================================================================================
#ifndef _WAVEFILE_H_	// インクルードガード開始
#define _WAVEFILE_H_	// インクルードガード用マクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <windows.h>
#include <mmsystem.h>

//*****************************************************************************
// クラス定義
//*****************************************************************************
//-------------------------------------
// Waveファイルを扱うクラス
//-------------------------------------
class CWaveFile
{
protected:
    WAVEFORMATEX	*	m_pwfx;			// WAVEFORMATEX 構造体ポインタ
    HMMIO				m_hmmio;		// WAVEファイル用MM I/O ハンドル
    MMCKINFO			m_ck;			// Multimedia RIFF chunk
    MMCKINFO			m_ckRiff;		// Use in opening a WAVE file
    DWORD				m_dwSize;		// WAVEファイルのサイズ
    BYTE			*	m_pbData;		// データポインタ
    DWORD				m_data_offset;	// dataチャンクまでのオフセット

protected:
	//-------------------------------------
	// WAVEファイルを読み込む
	//引数：	無
	//戻値：	HRESULT			…			成功時S_OK、エラー時それ以外
	//-------------------------------------
	HRESULT			ReadMMIO( void );
	//-------------------------------------
	// ファイルをリセット
	//引数：	無
	//戻値：	HRESULT			…			成功時S_OK、エラー時それ以外
	//-------------------------------------
	HRESULT			ResetFile( void );

public:
	//-------------------------------------
	//コンストラクタ（デフォルト）
	//-------------------------------------
	CWaveFile( void );
	//-------------------------------------
	//デストラクタ
	//-------------------------------------
	~CWaveFile( void );
	//-------------------------------------
	// WAVEファイルオープン
	//引数：	char *filename	…	[in]	WAVEファイル名
	//戻値：	BOOL			…			成功時TRUE、エラー時FALSE
	//-------------------------------------
	BOOL			Open( char *filename );
	//-------------------------------------
	// WAVEファイルを閉じる
	//引数：	無
	//戻値：	BOOL			…			成功時TRUE、エラー時FALSE
	//-------------------------------------
	BOOL			Close( void );
	//-------------------------------------
	// WAVEファイルを読み込む
	//引数：	BYTE	*	pBuffer			…	[out]	読み込み先のバッファポインタ
	//			DWORD		dwSizeToRead	…	[in]	読み込みたいサイズ
	//			DWORD	*	pdwSizeRead		…	[out]	実際に読み込んだサイズ
	//戻値：	BOOL						…			成功時TRUE、エラー時FALSE
	//-------------------------------------
	BOOL			Read( BYTE* pBuffer, DWORD dwSizeToRead, DWORD* pdwSizeRead );
	//-------------------------------------
	// シーク関数
	//引数：	int			offset			…	[in]	オフセット
	//			int			origin			…	[in]	オフセットの解釈方法フラグ(SEEK_~)
	//戻値：	BOOL						…			成功時TRUE、エラー時FALSE
	//-------------------------------------
	BOOL			Seek( int offset, int origin );
	//-------------------------------------
	// WAVEファイルのサイズ取得
	//引数：	無
	//戻値：	DWORD						…			WAVEファイルのサイズ
	//-------------------------------------
	DWORD			GetSize( void ){	return this->m_dwSize;	}
	//-------------------------------------
	// WAVEファイルのフォーマット情報取得
	//引数：	無
	//戻値：	WAVEFORMATEX	*			…			WAVEファイルのフォーマット
	//-------------------------------------
	WAVEFORMATEX	*GetFormat( void ){	return this->m_pwfx;	};
};

#endif // __WAVEFILE_H	// インクルードガード終了
